<PAD>,0
<UNK>,1
the,2
",",3
.,4
to,5
and,6
of,7
a,8
in,9
is,10
that,11
The,12
as,13
with,14
on,15
by,16
group,17
for,18
has,19
malware,20
used,21
),22
:,23
(,24
an,25
from,26
this,27
was,28
we,29
have,30
are,31
which,32
it,33
In,34
targeted,35
also,36
been,37
at,38
threat,39
be,40
their,41
attacks,42
or,43
campaign,44
using,45
malicious,46
attack,47
its,48
targeting,49
's,50
were,51
This,52
file,53
organizations,54
backdoor,55
other,56
use,57
government,58
activity,59
observed,60
not,61
targets,62
exploit,63
actors,64
code,65
these,66
data,67
against,68
attackers,69
new,70
We,71
known,72
one,73
first,74
since,75
information,76
target,77
files,78
they,79
”,80
Microsoft,81
can,82
tools,83
“,84
including,85
least,86
such,87
2017,88
into,89
same,90
our,91
operations,92
victims,93
campaigns,94
phishing,95
network,96
emails,97
vulnerability,98
will,99
access,100
two,101
groups,102
compromised,103
but,104
system,105
actor,106
Windows,107
more,108
document,109
financial,110
2018,111
systems,112
’s,113
documents,114
server,115
tool,116
active,117
Winnti,118
found,119
payload,120
based,121
APT33,122
China,123
companies,124
some,125
control,126
several,127
C2,128
researchers,129
legitimate,130
uses,131
2016,132
then,133
espionage,134
multiple,135
2015,136
exploits,137
APT,138
version,139
victim,140
well,141
security,142
Middle,143
through,144
It,145
name,146
sample,147
most,148
countries,149
infrastructure,150
time,151
RAT,152
different,153
FireEye,154
Group,155
2019,156
sent,157
email,158
remote,159
likely,160
previously,161
2014,162
analysis,163
another,164
DLL,165
discovered,166
all,167
samples,168
activities,169
infected,170
report,171
after,172
Russian,173
Chinese,174
Kaspersky,175
servers,176
identified,177
command,178
out,179
named,180
–,181
them,182
Trojan,183
additional,184
called,185
had,186
when,187
only,188
about,189
being,190
both,191
previous,192
compromise,193
via,194
North,195
may,196
East,197
related,198
techniques,199
early,200
than,201
associated,202
zero-day,203
during,204
spear,205
APT10,206
While,207
over,208
specific,209
',210
research,211
between,212
APT41,213
recent,214
Iranian,215
organization,216
Word,217
Operation,218
military,219
software,220
South,221
A,222
IP,223
number,224
process,225
within,226
Korean,227
Asia,228
believe,229
2013,230
able,231
institutions,232
defense,233
As,234
;,235
script,236
service,237
seen,238
function,239
media,240
primarily,241
spear-phishing,242
individuals,243
entities,244
following,245
similar,246
recently,247
computer,248
behind,249
three,250
users,251
Turla,252
address,253
order,254
Flash,255
company,256
download,257
Russia,258
May,259
addition,260
custom,261
attacker,262
various,263
Korea,264
Threat,265
—,266
APT1,267
United,268
executable,269
steal,270
who,271
those,272
machine,273
Europe,274
commands,275
However,276
available,277
These,278
located,279
initial,280
networks,281
years,282
backdoors,283
user,284
any,285
Office,286
appears,287
If,288
cyber,289
designed,290
if,291
names,292
reported,293
services,294
run,295
April,296
conducted,297
set,298
FIN7,299
Saudi,300
include,301
install,302
execute,303
last,304
sectors,305
host,306
execution,307
social,308
focused,309
case,310
where,311
there,312
contains,313
published,314
computers,315
part,316
C&C,317
exploiting,318
main,319
March,320
interest,321
very,322
versions,323
evidence,324
described,325
across,326
operating,327
credentials,328
domain,329
ZxShell,330
year,331
further,332
executed,333
CTU,334
variant,335
CVE-2012-0158,336
U.S.,337
like,338
operation,339
highly,340
high,341
After,342
Since,343
second,344
module,345
June,346
Carbanak,347
linked,348
delivered,349
Lazarus,350
web,351
specifically,352
OceanLotus,353
before,354
key,355
could,356
configuration,357
hacking,358
unknown,359
detection,360
bank,361
addresses,362
around,363
States,364
example,365
customers,366
public,367
deliver,368
Security,369
analyzed,370
focus,371
For,372
PowerShell,373
ScarCruft,374
industry,375
decoy,376
APT28,377
Panda,378
many,379
engineering,380
implant,381
To,382
banks,383
embedded,384
suspected,385
operators,386
leveraged,387
industries,388
APT38,389
blog,390
publicly,391
Japan,392
December,393
back,394
November,395
attachment,396
technology,397
They,398
past,399
vulnerabilities,400
intelligence,401
still,402
sector,403
capabilities,404
Symantec,405
websites,406
written,407
involved,408
shows,409
infection,410
identify,411
variants,412
Eastern,413
started,414
accounts,415
detected,416
DNS,417
contained,418
Japanese,419
employees,420
each,421
deployed,422
banking,423
while,424
later,425
exploited,426
On,427
possible,428
Taiwan,429
Adobe,430
Intelligence,431
list,432
Based,433
particular,434
so,435
persistence,436
intrusion,437
running,438
created,439
block,440
directly,441
containing,442
Silence,443
image,444
point,445
even,446
would,447
archive,448
responsible,449
deploy,450
attachments,451
spearphishing,452
often,453
August,454
political,455
Once,456
One,457
fake,458
US,459
attempts,460
region,461
value,462
send,463
Hong,464
source,465
however,466
September,467
macro,468
content,469
provide,470
tactics,471
Arabia,472
February,473
personnel,474
released,475
confidence,476
developed,477
do,478
mainly,479
installed,480
method,481
how,482
Lab,483
common,484
telecommunications,485
motivated,486
website,487
interesting,488
support,489
encrypted,490
processes,491
technique,492
attributed,493
Kong,494
details,495
open,496
few,497
watering,498
gain,499
TG-3390,500
traffic,501
Dexphot,502
January,503
what,504
suggests,505
us,506
hosted,507
appear,508
original,509
Unit,510
cases,511
memory,512
MuddyWater,513
latest,514
continues,515
post,516
Southeast,517
modules,518
registry,519
TTPs,520
either,521
July,522
’,523
2011,524
application,525
update,526
unique,527
popular,528
call,529
working,530
stage,531
Our,532
functionality,533
made,534
hackers,535
APT12,536
APT32,537
2012,538
stealing,539
According,540
included,541
domains,542
IT,543
late,544
patched,545
global,546
attempt,547
interests,548
stolen,549
large,550
NetTraveler,551
below,552
investigation,553
loader,554
agencies,555
itself,556
assess,557
game,558
date,559
governments,560
Team,561
methods,562
significant,563
no,564
monitoring,565
persistent,566
developers,567
Defender,568
payloads,569
industrial,570
range,571
instead,572
perform,573
inside,574
continued,575
Player,576
shell,577
components,578
APT37,579
providers,580
October,581
products,582
collect,583
scripts,584
Vietnam,585
energy,586
ZIP,587
world,588
team,589
business,590
does,591
embassies,592
contain,593
From,594
universities,595
modified,596
SHA256,597
next,598
current,599
strategic,600
Bookworm,601
Poison,602
Cyber,603
manufacturing,604
provides,605
downloaded,606
variable,607
again,608
leverages,609
During,610
Taiwanese,611
encoded,612
links,613
others,614
foreign,615
Kitten,616
family,617
string,618
obfuscated,619
chain,620
RTF,621
Central,622
account,623
work,624
end,625
1,626
attempted,627
up,628
Ivy,629
usually,630
Trend,631
macros,632
Emissary,633
Gamaredon,634
binary,635
When,636
Iran,637
reports,638
incident,639
CVE-2017-11882,640
track,641
human,642
admin@338,643
includes,644
At,645
typically,646
rights,647
months,648
framework,649
machines,650
dropped,651
hole,652
now,653
functions,654
Remote,655
changes,656
believed,657
along,658
create,659
dropper,660
intrusions,661
Google,662
development,663
connection,664
continue,665
possibly,666
ATP,667
conduct,668
began,669
appeared,670
shared,671
library,672
own,673
HTTP,674
allows,675
financially,676
URL,677
infect,678
resource,679
certificates,680
connected,681
password,682
look,683
make,684
tracked,685
theft,686
officials,687
Palestinian,688
communication,689
fact,690
link,691
2,692
actively,693
technical,694
India,695
BRONZE,696
directory,697
Asian,698
2008,699
path,700
environment,701
threats,702
private,703
launched,704
received,705
Indian,706
dissidents,707
Analysis,708
under,709
indicates,710
country,711
2009,712
video,713
having,714
individual,715
ESET,716
among,717
Some,718
resources,719
SectorJ04,720
updated,721
older,722
tracking,723
families,724
ability,725
installation,726
successfully,727
state-sponsored,728
journalists,729
Equation,730
response,731
because,732
yet,733
wild,734
effort,735
suggest,736
once,737
Micro,738
documented,739
potential,740
mode,741
see,742
sensitive,743
national,744
section,745
means,746
load,747
type,748
downloader,749
hide,750
APT17,751
Both,752
without,753
aka,754
ShadowPad,755
majority,756
Espionage,757
provided,758
port,759
stored,760
almost,761
already,762
Additionally,763
URLs,764
24,765
Bahamut,766
take,767
activists,768
commonly,769
flow,770
above,771
detect,772
earlier,773
ransomware,774
telemetry,775
firms,776
folder,777
Although,778
HIGHTIDE,779
separate,780
SFX,781
There,782
registered,783
seems,784
sites,785
compromising,786
profile,787
lure,788
property,789
intellectual,790
Quasar,791
commercial,792
advanced,793
features,794
ongoing,795
communications,796
strings,797
diplomatic,798
delivery,799
uncovered,800
high-profile,801
contractors,802
text,803
did,804
42,805
former,806
movement,807
small,808
LEAD,809
executing,810
heavily,811
series,812
weaponized,813
much,814
BlackOasis,815
Lotus,816
instance,817
Ukraine,818
just,819
successful,820
Leafminer,821
comparison,822
API,823
compiled,824
carried,825
find,826
remains,827
Barium,828
card,829
proxy,830
advantage,831
Thailand,832
week,833
avoid,834
days,835
times,836
Rancor,837
contents,838
starts,839
exploitation,840
makes,841
standard,842
4,843
open-source,844
corporate,845
stages,846
OS,847
Suckfly,848
every,849
move,850
distinct,851
CVE-2017-0199,852
vector,853
firm,854
structure,855
record,856
final,857
CVE-2016-4117,858
New,859
noted,860
discussed,861
attempting,862
message,863
PIVY,864
direct,865
attacking,866
Machete,867
Sea,868
Blossom,869
month,870
By,871
EternalBlue,872
installer,873
request,874
foothold,875
Hound,876
mentioned,877
receive,878
task,879
well-known,880
upload,881
WannaCry,882
UTC,883
confirmed,884
shellcode,885
added,886
tasks,887
Western,888
drop,889
compromises,890
local,891
Magic,892
Advanced,893
Ministry,894
state,895
wide,896
Elfin,897
certain,898
oil,899
PlugX,900
Bemstour,901
center,902
executes,903
10,904
NEODYMIUM,905
should,906
rather,907
dubbed,908
beginning,909
revealed,910
Java,911
Cobalt,912
BARIUM,913
adversary,914
day,915
changed,916
Internet,917
device,918
hardcoded,919
Group-IB,920
refer,921
although,922
An,923
utilized,924
gaming,925
referred,926
aerospace,927
check,928
bytes,929
messages,930
law,931
connections,932
similarities,933
launcher,934
throughout,935
Sofacy,936
downloading,937
attached,938
online,939
cloud,940
cyberespionage,941
Shadow,942
query,943
simple,944
antivirus,945
Figure,946
took,947
policy,948
controller,949
experts,950
primary,951
values,952
copy,953
read,954
level,955
Brokers,956
wave,957
Tibetan,958
conducting,959
supply,960
client,961
Buckeye,962
real,963
relevant,964
records,965
affected,966
long,967
mostly,968
executables,969
generated,970
utility,971
Twitter,972
four,973
ties,974
America,975
Glimpse,976
attention,977
attribute,978
leverage,979
shown,980
operator,981
passwords,982
victim’s,983
according,984
scheduled,985
variety,986
leveraging,987
Daserf,988
Pakistan,989
China-based,990
simply,991
chemical,992
making,993
Exfiltration,994
change,995
component,996
attacked,997
obfuscation,998
get,999
HTML,1000
Vietnamese,1001
onto,1002
APT34,1003
Linux,1004
together,1005
programs,1006
UK,1007
think,1008
[REDACTED].ddns.net,1009
purpose,1010
decrypt,1011
binaries,1012
allowing,1013
money,1014
drops,1015
modify,1016
members,1017
PROMETHIUM,1018
CIA,1019
cybercrime,1020
privilege,1021
detailed,1022
Oct,1023
established,1024
involving,1025
indicate,1026
MS,1027
credential,1028
Department,1029
remotely,1030
numerous,1031
sending,1032
handle,1033
Ukrainian,1034
connect,1035
maintain,1036
off,1037
obtained,1038
though,1039
.NET,1040
education,1041
PDF,1042
particularly,1043
APT16,1044
full,1045
Philippines,1046
Attackers,1047
internal,1048
Mimikatz,1049
consistent,1050
closely,1051
led,1052
widely,1053
capable,1054
initially,1055
extensive,1056
collected,1057
checks,1058
Carberp,1059
WinRAR,1060
RIPTIDE,1061
aviation,1062
author,1063
XOR,1064
healthcare,1065
sophisticated,1066
protection,1067
vulnerable,1068
engaged,1069
Given,1070
efforts,1071
blocks,1072
CVE-2018-0798,1073
BUTLER,1074
hundreds,1075
whose,1076
Outlaw,1077
actions,1078
show,1079
program,1080
distributed,1081
reporting,1082
caught,1083
botnet,1084
single,1085
More,1086
Excel,1087
demonstrated,1088
Server,1089
enable,1090
given,1091
capture,1092
lateral,1093
WEBC2,1094
Thu,1095
extract,1096
saw,1097
international,1098
Foreign,1099
uploaded,1100
personal,1101
leading,1102
relies,1103
payment,1104
login,1105
limited,1106
implementation,1107
relatively,1108
/,1109
Soviet,1110
PM,1111
economic,1112
amount,1113
overlap,1114
news,1115
due,1116
Network,1117
future,1118
spread,1119
environments,1120
Mandiant,1121
Using,1122
package,1123
location,1124
operational,1125
employs,1126
Visma,1127
spam,1128
internet,1129
came,1130
actually,1131
runs,1132
reconnaissance,1133
understand,1134
TA505,1135
Shanghai,1136
paper,1137
interested,1138
DLLs,1139
cyber-espionage,1140
downloads,1141
job,1142
might,1143
Finally,1144
prior,1145
intended,1146
Scattered,1147
Republic,1148
gained,1149
calls,1150
piece,1151
until,1152
Dropbox,1153
Rapid7,1154
MoneyTaker,1155
period,1156
origin,1157
routine,1158
MSPs,1159
With,1160
turn,1161
overlaps,1162
implemented,1163
Buhtrap,1164
five,1165
characteristics,1166
build,1167
arsenal,1168
procedures,1169
Black,1170
Ursnif,1171
trick,1172
disguised,1173
know,1174
difficult,1175
types,1176
breach,1177
Government,1178
static,1179
results,1180
GRIFFON,1181
hosting,1182
you,1183
action,1184
443,1185
fraud,1186
screenshot,1187
loaded,1188
line,1189
cryptocurrency,1190
authors,1191
group’s,1192
largely,1193
destructive,1194
far,1195
page,1196
points,1197
probably,1198
search,1199
entry,1200
escalation,1201
screenshots,1202
major,1203
APT35,1204
enabling,1205
File,1206
format,1207
JhoneRAT,1208
encryption,1209
IXESHE,1210
decoded,1211
share,1212
toolset,1213
indicating,1214
utilizing,1215
effective,1216
scanning,1217
themselves,1218
enabled,1219
Over,1220
clear,1221
evade,1222
followed,1223
patterns,1224
All,1225
European,1226
exfiltrated,1227
transactions,1228
site,1229
X,1230
need,1231
Dukes,1232
focuses,1233
approximately,1234
basic,1235
laterally,1236
creates,1237
Variant,1238
high-tech,1239
devices,1240
ANEL,1241
protocol,1242
employed,1243
behavior,1244
SOC,1245
developer,1246
Naikon,1247
analysts,1248
French,1249
ACT,1250
random,1251
vendor,1252
Upon,1253
goal,1254
hosts,1255
Despite,1256
Networks,1257
belonging,1258
ones,1259
opening,1260
collection,1261
nature,1262
Cloud,1263
language,1264
lures,1265
Talos,1266
form,1267
start,1268
platform,1269
provider,1270
VPN,1271
outside,1272
browser,1273
updates,1274
detail,1275
OilRig,1276
app,1277
issued,1278
installing,1279
regions,1280
-,1281
Most,1282
potentially,1283
Turkey,1284
criminal,1285
hacker,1286
Uyghur,1287
leak,1288
teams,1289
Android,1290
upon,1291
corporations,1292
Mofang,1293
hop,1294
Another,1295
ASUS,1296
managed,1297
SWAnalytics,1298
cybercriminals,1299
Nitro,1300
Chopper,1301
purposes,1302
ensure,1303
patch,1304
codes,1305
conducts,1306
TCP,1307
always,1308
spyware,1309
20,1310
consumer,1311
hijacking,1312
algorithm,1313
built,1314
performed,1315
JavaScript,1316
KeyBoy,1317
never,1318
certificate,1319
applications,1320
result,1321
monitor,1322
pages,1323
ﬁle,1324
noticed,1325
intruders,1326
Okrum,1327
ATM,1328
bypass,1329
RATs,1330
operated,1331
TEMP.Veles,1332
discovery,1333
Alto,1334
toolkit,1335
Palo,1336
creating,1337
existing,1338
fileless,1339
Instead,1340
gang,1341
byte,1342
seem,1343
larger,1344
sets,1345
help,1346
publication,1347
metadata,1348
decrypted,1349
allow,1350
present,1351
exfiltrate,1352
inject,1353
threads,1354
sometimes,1355
pharmaceutical,1356
Waterbug,1357
massive,1358
secondary,1359
subsequent,1360
incidents,1361
Belarus,1362
virtual,1363
SMB,1364
filename,1365
insight,1366
Malware,1367
leaked,1368
aware,1369
Molerats,1370
2010,1371
maturity,1372
Proofpoint,1373
determine,1374
Update,1375
LuckyMouse,1376
proprietary,1377
here,1378
XENOTIME,1379
seemingly,1380
Carbon,1381
Thrip,1382
Germany,1383
implants,1384
Dragon,1385
volume,1386
object,1387
ATMs,1388
launch,1389
frequently,1390
aligned,1391
Cisco,1392
communicating,1393
observe,1394
Remexi,1395
mechanism,1396
First,1397
SWC,1398
opposed,1399
Dragos,1400
hidden,1401
creation,1402
requests,1403
Arabian,1404
OSX_DOK.C,1405
event,1406
Center,1407
artifacts,1408
zero,1409
ID,1410
Africa,1411
disk,1412
gas,1413
keyboard,1414
PLATINUM,1415
notable,1416
increase,1417
indicators,1418
unpatched,1419
But,1420
gather,1421
electronics,1422
Other,1423
alerts,1424
become,1425
approach,1426
quickly,1427
Similar,1428
presence,1429
webshell,1430
believes,1431
base,1432
loop,1433
APT40,1434
titled,1435
enterprises,1436
tries,1437
000,1438
increased,1439
employing,1440
16,1441
Loader,1442
0,1443
important,1444
broad,1445
looking,1446
Exchange,1447
digital,1448
processing,1449
we've,1450
opened,1451
bot,1452
Myanmar,1453
installs,1454
mynetwork.ddns.net,1455
Kazakhstan,1456
ITG08,1457
Researchers,1458
sideloading,1459
staff,1460
Seedworm,1461
2004,1462
aimed,1463
KopiLuwak,1464
relations,1465
unclear,1466
keys,1467
COBALT,1468
determined,1469
deploying,1470
large-scale,1471
knowledge,1472
gathering,1473
Latin,1474
ultimately,1475
NewsBeef,1476
reverse,1477
core,1478
quite,1479
underground,1480
figures,1481
especially,1482
maritime,1483
Research,1484
Flying,1485
Further,1486
typical,1487
instances,1488
English,1489
Bank,1490
commodity,1491
gaining,1492
hard,1493
exclusively,1494
phone,1495
DoublePulsar,1496
manipulate,1497
kit,1498
traditional,1499
generally,1500
sends,1501
Gaza,1502
extension,1503
capability,1504
subject,1505
issues,1506
holes,1507
buffer,1508
CIA's,1509
said,1510
Editor,1511
Trochilus,1512
recipient,1513
extracted,1514
detections,1515
reportedly,1516
achieve,1517
events,1518
similarly,1519
Affairs,1520
downloaders,1521
actual,1522
moderate,1523
parent,1524
party,1525
BLACKCOFFEE,1526
cover,1527
Israel,1528
agency,1529
mining,1530
decryption,1531
assesses,1532
browsers,1533
true,1534
going,1535
hard-coded,1536
5,1537
manage,1538
worm,1539
uploading,1540
Information,1541
WATERSPOUT,1542
six,1543
AveMaria,1544
RAR,1545
signed,1546
registration,1547
dates,1548
attribution,1549
investigating,1550
remained,1551
removed,1552
8,1553
became,1554
administration,1555
driver,1556
e-mail,1557
GYPSY,1558
Between,1559
contact,1560
aligns,1561
sources,1562
minority,1563
remain,1564
criminals,1565
businesses,1566
POST,1567
Leviathan,1568
simultaneously,1569
Wild,1570
Tick,1571
Neutron,1572
objective,1573
Ke3chang,1574
unusual,1575
Gh0st,1576
ﬁles,1577
Like,1578
customer,1579
PLA,1580
suspicious,1581
UNION,1582
saved,1583
RevengeHotels,1584
Taidoor,1585
allowed,1586
tactic,1587
diplomats,1588
3,1589
Access,1590
Canary,1591
privileges,1592
encoding,1593
objectives,1594
CopyPaste,1595
whether,1596
MSI,1597
loading,1598
opaque,1599
Name,1600
apparently,1601
evolving,1602
32-bit,1603
finally,1604
worth,1605
parameter,1606
diaspora,1607
vectors,1608
remaining,1609
evolution,1610
native,1611
hours,1612
weeks,1613
Turtle,1614
database,1615
distribute,1616
investigated,1617
vendors,1618
states,1619
immediate,1620
instruction,1621
PE,1622
instructions,1623
ShadowHammer,1624
APT39,1625
significantly,1626
Tropic,1627
Code,1628
place,1629
affiliated,1630
claimed,1631
executives,1632
mission,1633
&,1634
currently,1635
weaponizer,1636
Trooper,1637
post-exploitation,1638
Bisonal,1639
Axiom,1640
behaviors,1641
adversaries,1642
batch,1643
listed,1644
loads,1645
injection,1646
FTP,1647
consider,1648
BalkanDoor,1649
taken,1650
Protection,1651
pattern,1652
highlight,1653
placed,1654
More_eggs,1655
WhiteBear,1656
cybercriminal,1657
User,1658
So,1659
Daybreak,1660
GandCrab,1661
levels,1662
OLE,1663
LYCEUM,1664
goals,1665
clients,1666
plugin,1667
modifications,1668
.png,1669
ping,1670
deployment,1671
drive,1672
DragonOK,1673
12,1674
supporting,1675
Interestingly,1676
operate,1677
way,1678
longer,1679
looks,1680
utilizes,1681
CVE-2014-6332,1682
people,1683
architecture,1684
configured,1685
thousands,1686
outlets,1687
Command,1688
thread,1689
Service,1690
member,1691
match,1692
Erebus,1693
command-and-control,1694
easily,1695
Recorded,1696
predicates,1697
SWIFT,1698
THREEBYTE,1699
German,1700
steganography,1701
newly,1702
conjunction,1703
infamous,1704
Charming,1705
miner,1706
hijacked,1707
Mac,1708
connects,1709
supports,1710
Web,1711
14,1712
PassCV,1713
total,1714
suggesting,1715
return,1716
HIDDEN,1717
COBRA,1718
summer,1719
worldwide,1720
TEMP.Hermit,1721
desktop,1722
role,1723
ALLANITE,1724
accessible,1725
menuPass,1726
community,1727
Zebrocy,1728
cluster,1729
profiles,1730
hotel,1731
note,1732
calling,1733
HTTPBrowser,1734
WERDLOD,1735
required,1736
third,1737
VirusTotal,1738
writing,1739
endpoint,1740
hospitality,1741
SharePoint,1742
tracks,1743
Python,1744
Union,1745
fraudulent,1746
employ,1747
alleged,1748
strong,1749
alert,1750
Unlike,1751
JHUHUGIT,1752
register,1753
testing,1754
blocking,1755
RC4,1756
despite,1757
Switzerland,1758
educational,1759
Filename:,1760
his,1761
red,1762
enables,1763
engine,1764
17,1765
MitM,1766
redirect,1767
clusters,1768
solutions,1769
suspect,1770
Rocket,1771
performing,1772
Monday,1773
People,1774
examined,1775
performs,1776
MiniDuke,1777
61398,1778
serial,1779
takes,1780
KHRAT,1781
kernel,1782
Bureau,1783
shift,1784
eventually,1785
Cybereason,1786
normal,1787
critical,1788
size,1789
manually,1790
NGOs,1791
Even,1792
themes,1793
Control,1794
Elise,1795
naming,1796
review,1797
relying,1798
Gamma,1799
feature,1800
crafted,1801
Epic,1802
Cybergang,1803
intent,1804
DHS,1805
combination,1806
circumvent,1807
Arbor,1808
Also,1809
context,1810
export,1811
MD5,1812
infections,1813
stealer,1814
American,1815
decided,1816
less,1817
Patchwork,1818
toolsets,1819
complete,1820
explained,1821
focusing,1822
compilation,1823
compared,1824
training,1825
Shell,1826
globe,1827
special,1828
360,1829
Query:,1830
CVE-2017-0144,1831
Qatar,1832
Facebook,1833
Storm,1834
consists,1835
Poland,1836
dropping,1837
Federation,1838
trojan,1839
manufacturers,1840
National,1841
ELMER,1842
obtain,1843
internally,1844
Apple,1845
verticals,1846
release,1847
subsequently,1848
telecoms,1849
returned,1850
external,1851
impact,1852
expanded,1853
starting,1854
examples,1855
ICS,1856
too,1857
Donot,1858
error,1859
utilities,1860
detailing,1861
callback,1862
Canada,1863
necessary,1864
window,1865
advisory,1866
rely,1867
Empire,1868
pointer,1869
communicate,1870
history,1871
injected,1872
McAfee,1873
petrochemical,1874
Romania,1875
FBI,1876
#2,1877
spy,1878
investigations,1879
protected,1880
secure,1881
SWCs,1882
python,1883
valid,1884
picture,1885
agent,1886
highlighted,1887
scan,1888
CVE-2018-0802,1889
institution,1890
travel,1891
self-extracting,1892
retrieve,1893
triggered,1894
Derusbi,1895
reasons,1896
powerful,1897
body,1898
complaint,1899
central,1900
stole,1901
hacked,1902
exposed,1903
startup,1904
Nepal,1905
Data,1906
TeamViewer,1907
decode,1908
profit,1909
Of,1910
acts,1911
shares,1912
improved,1913
Invader,1914
continuous,1915
enterprise,1916
we'll,1917
transaction,1918
controlled,1919
ethnic,1920
France,1921
locations,1922
exact,1923
dispatcher,1924
shortly,1925
macro-enabled,1926
aggressive,1927
visible,1928
Tool,1929
zones,1930
requires,1931
widespread,1932
distribution,1933
modular,1934
mechanisms,1935
Pawn,1936
vast,1937
regional,1938
prominent,1939
hundred,1940
requirements,1941
Many,1942
professionals,1943
keep,1944
archives,1945
Kingdom,1946
investigate,1947
establishing,1948
Dragonfly,1949
begins,1950
lead,1951
zone,1952
mail,1953
IPs,1954
Its,1955
dating,1956
Group123,1957
done,1958
describe,1959
Beginning,1960
APT5,1961
specially,1962
begin,1963
Kazuar,1964
newer,1965
options,1966
injecting,1967
therefore,1968
Thus,1969
Infy,1970
code-named,1971
Mimic,1972
moved,1973
spreading,1974
prolific,1975
layout,1976
header,1977
45,1978
dynamic,1979
detecting,1980
formerly,1981
spotted,1982
Base64,1983
needs,1984
protect,1985
Moafee,1986
citizens,1987
operates,1988
Pierogi,1989
disclosed,1990
TXT,1991
hash,1992
11b4,1993
passed,1994
Drive,1995
optimization,1996
MAC,1997
POWRUNER,1998
PwC,1999
try,2000
Malaysia,2001
Slovakia,2002
Ketrican,2003
notorious,2004
parameters,2005
Trojans,2006
indicator,2007
100,2008
hit,2009
identical,2010
governmental,2011
Spring,2012
store,2013
consistently,2014
Butterfly,2015
codenamed,2016
delete,2017
default,2018
scope,2019
repeatedly,2020
non-public,2021
down,2022
identifier,2023
referenced,2024
article,2025
occurred,2026
Response:,2027
Turkish,2028
recipients,2029
ago,2030
Initial,2031
workstation,2032
Outlook,2033
respectively,2034
higher,2035
Hamas,2036
power,2037
Moving,2038
utilize,2039
maintained,2040
best,2041
writes,2042
jump,2043
Thursday,2044
earliest,2045
cmd.exe,2046
entire,2047
CrowdStrike,2048
complex,2049
hpqhvsei.dll,2050
That,2051
webshells,2052
nations,2053
PLEAD,2054
demonstrates,2055
changing,2056
functionalities,2057
distributing,2058
audio,2059
detects,2060
spoofed,2061
behalf,2062
Visual,2063
relationship,2064
keylogger,2065
System,2066
Banker,2067
Citrix,2068
tried,2069
BlackEnergy,2070
base64,2071
course,2072
25,2073
serve,2074
domestic,2075
purported,2076
discover,2077
Following,2078
close,2079
live,2080
Corkow,2081
200,2082
why,2083
publications,2084
steps,2085
Potao,2086
CVE-2015-1701,2087
purchased,2088
originated,2089
sponsored,2090
MSIL,2091
Systems,2092
Just,2093
overlapping,2094
evasion,2095
infects,2096
Basic,2097
Intel,2098
Each,2099
general,2100
remove,2101
graph,2102
Client,2103
frequent,2104
Through,2105
Recently,2106
Metasploit,2107
queries,2108
matches,2109
exposure,2110
white,2111
Counter,2112
Bluetooth,2113
top,2114
Powermud,2115
Aumlib,2116
expand,2117
Insikt,2118
delivers,2119
APT29,2120
regular,2121
chosen,2122
extensively,2123
keystrokes,2124
forums,2125
variables,2126
shells,2127
multi-stage,2128
LOWBALL,2129
Greece,2130
Scarlet,2131
election,2132
represent,2133
KONNI,2134
cache,2135
noting,2136
HyperBro,2137
HTA,2138
customized,2139
Explorer,2140
log,2141
deal,2142
involves,2143
password-protected,2144
old,2145
learning,2146
Pakistani,2147
break,2148
communicates,2149
evolved,2150
Moreover,2151
follow,2152
differences,2153
interface,2154
Table,2155
packed,2156
TAU,2157
HTRAN,2158
confidential,2159
capturing,2160
POWERSTATS,2161
mapping,2162
interact,2163
modification,2164
hpqhvind.exe,2165
shortcut,2166
affairs,2167
crime,2168
disguise,2169
stores,2170
Belgium,2171
cash,2172
increasingly,2173
Here,2174
credit,2175
iOS,2176
packet,2177
Crambus,2178
Execution,2179
assigned,2180
junk,2181
activist,2182
clearly,2183
seven,2184
visibility,2185
table,2186
controls,2187
Ajax,2188
TRITON,2189
timestamp,2190
origins,2191
went,2192
compressed,2193
intruder,2194
assets,2195
ACE,2196
PowerPoint,2197
replaces,2198
Several,2199
Filensfer,2200
decade,2201
Sima,2202
light,2203
Labs,2204
medical,2205
choice,2206
normally,2207
must,2208
surveillance,2209
reveals,2210
Furthermore,2211
Iranians,2212
entity,2213
18,2214
Kuwait,2215
thus,2216
specializes,2217
audiences,2218
finance,2219
production,2220
deleted,2221
Downeks,2222
employee,2223
aACT,2224
LOCs,2225
collecting,2226
regime,2227
Arabic-speaking,2228
transfer,2229
checking,2230
Year,2231
civil,2232
existence,2233
allegedly,2234
Reader,2235
iSIGHT,2236
Sometimes,2237
7,2238
false,2239
logging,2240
trade,2241
regularly,2242
specialized,2243
Future,2244
FQDNs,2245
enough,2246
product,2247
AdrGen,2248
flattening,2249
issue,2250
Their,2251
originate,2252
carrying,2253
Strike,2254
Though,2255
shifted,2256
SecureWorks,2257
scale,2258
things,2259
disruptive,2260
contacts,2261
flattened,2262
launching,2263
confirm,2264
Democratic,2265
forum,2266
organisations,2267
militaries,2268
Hopper,2269
ways,2270
expect,2271
Argentina,2272
carries,2273
valuable,2274
gathered,2275
condition,2276
view,2277
filtering,2278
ROKRAT,2279
endpoints,2280
Homeland,2281
11,2282
retail,2283
outbound,2284
sought,2285
stack,2286
automotive,2287
anti-virus,2288
narrative,2289
works,2290
in-memory,2291
leads,2292
complicated,2293
traced,2294
Egypt,2295
uploads,2296
characterized,2297
Iraq,2298
UAE,2299
Examples,2300
randomly,2301
depending,2302
Netherlands,2303
Meterpreter,2304
breached,2305
considered,2306
e-mails,2307
derived,2308
routines,2309
Standard,2310
72,2311
26,2312
millions,2313
aforementioned,2314
output,2315
cyberattacks,2316
infecting,2317
politically,2318
seemed,2319
HexRaysDeob,2320
difference,2321
Chinese-speaking,2322
Army,2323
conglomerate,2324
delivering,2325
scheme,2326
DDoS,2327
letter,2328
EXE,2329
acquire,2330
embedding,2331
relied,2332
persona,2333
verify,2334
regarding,2335
doing,2336
flash,2337
largest,2338
It's,2339
findings,2340
carry,2341
trying,2342
microcode,2343
Services,2344
undiscovered,2345
CosmicDuke,2346
organization's,2347
cybersecurity,2348
obtaining,2349
Domain,2350
stealthy,2351
stealers,2352
USB,2353
invitations,2354
Volgmer,2355
mblock_t,2356
aims,2357
DOJ,2358
BITTER,2359
oldest,2360
Brazil,2361
university,2362
identifying,2363
ClearSky,2364
generates,2365
session,2366
Prior,2367
images,2368
missions,2369
continuing,2370
hollowing,2371
msiexec.exe,2372
ZeroT,2373
IRC,2374
Execute,2375
BalkanRAT,2376
benefit,2377
color,2378
initiate,2379
suite,2380
designated,2381
monitors,2382
rare,2383
‘,2384
Because,2385
ACTs,2386
And,2387
million,2388
unzIP,2389
BAE,2390
blogpost,2391
affecting,2392
design,2393
immediately,2394
settings,2395
reason,2396
CBR,2397
wiper,2398
pool,2399
Later,2400
offset,2401
Minzen,2402
Chrome,2403
UPX,2404
exchange,2405
tags,2406
archiving,2407
maintaining,2408
array,2409
Dropper,2410
TA459,2411
CVE-2017-0143,2412
SHIPPING_MX00034900_PL_INV_pdf.zip,2413
greater,2414
today,2415
unprecedented,2416
selection,2417
extra,2418
academic,2419
market,2420
PNG,2421
conference,2422
matching,2423
displayed,2424
warning,2425
spying,2426
sign,2427
Active,2428
Organizations,2429
U.S,2430
VBScript,2431
Bear,2432
numbers,2433
50,2434
Hat,2435
Secureworks,2436
40,2437
MENA,2438
IIS,2439
exist,2440
Australia,2441
generic,2442
USA,2443
Chafer,2444
Sednit,2445
externally,2446
storage,2447
Defense,2448
Computer,2449
York,2450
properties,2451
2.0,2452
retooling,2453
PRC,2454
installers,2455
good,2456
exists,2457
logs,2458
Silence:,2459
Run,2460
tricks,2461
Adversary,2462
Group-3390,2463
arbitrary,2464
KerrDown,2465
Ixeshe,2466
webpage,2467
generate,2468
Azerbaijan,2469
minutes,2470
REDBALDKNIGHT,2471
reviewing,2472
neighboring,2473
Novetta,2474
trusted,2475
supported,2476
PsExec,2477
EPS,2478
Lurk,2479
entice,2480
.doc,2481
hook,2482
shipping,2483
ProjectSauron,2484
Atlas,2485
giving,2486
better,2487
3rd,2488
General,2489
showed,2490
Today,2491
manner,2492
App,2493
Store,2494
etc,2495
Sandworm,2496
emerged,2497
resulted,2498
Development,2499
free,2500
ports,2501
darkside,2502
C2s,2503
HIGHNOON,2504
objects,2505
Authority,2506
Asia-Pacific,2507
receives,2508
Serbia,2509
Times,2510
attributes,2511
spawns,2512
CVE-2017-8759,2513
collects,2514
official,2515
mutex,2516
go,2517
builder,2518
config,2519
presented,2520
great,2521
needed,2522
JScript,2523
coded,2524
developing,2525
unsophisticated,2526
beyond,2527
sharing,2528
usage,2529
LUCKY,2530
ELEPHANT,2531
blocked,2532
lot,2533
Persian,2534
Powershell,2535
topics,2536
MS17-010,2537
blue,2538
tailored,2539
Cambodia,2540
Desktop,2541
XLS,2542
Uzbekistan,2543
Hackers,2544
Detected,2545
VBA,2546
IRONHALO,2547
reference,2548
behavioral,2549
Lebanon,2550
clipboard,2551
64-bit,2552
DPP,2553
half,2554
labels,2555
plain,2556
input,2557
Silence’s,2558
owned,2559
TajMahal,2560
novel,2561
n’t,2562
alongside,2563
independent,2564
observations,2565
URI,2566
Italy,2567
Ofﬁce,2568
Spain,2569
DeepSight,2570
penetration,2571
unrelated,2572
occasionally,2573
ﬁrst,2574
Create,2575
scheduler,2576
solely,2577
dozens,2578
automatically,2579
Chile,2580
cyberweapons,2581
Directory,2582
Cyrillic,2583
latter,2584
AES,2585
expanding,2586
APT41's,2587
parts,2588
conclude,2589
editing,2590
28,2591
well-funded,2592
modifying,2593
2007,2594
Buckeye's,2595
Arab,2596
SETTINGS\{user}\LOCAL,2597
C:\DOCUMENTS,2598
Pteranodon,2599
Task,2600
surrounding,2601
assessment,2602
Targeted,2603
30,2604
Bitcoin,2605
chose,2606
CCleaner,2607
smart,2608
screen,2609
comprehensive,2610
geopolitical,2611
deeper,2612
varies,2613
third-party,2614
accessing,2615
prevent,2616
RDP,2617
showing,2618
helped,2619
Canary’s,2620
strategies,2621
naval,2622
listing,2623
actor-controlled,2624
breaches,2625
establish,2626
packages,2627
corruption,2628
AV,2629
repository,2630
Additional,2631
Justice,2632
ministries,2633
SMBv1,2634
RTLO,2635
VBS,2636
divided,2637
counter,2638
Mark,2639
represents,2640
Falun,2641
non-governmental,2642
illustrates,2643
redirection,2644
Backdoor.Nidiran,2645
sponsor,2646
arguments,2647
rest,2648
engage,2649
SMS,2650
defined,2651
dissident,2652
defence,2653
Creators,2654
resolved,2655
providing,2656
controlling,2657
WinHTTPHelper,2658
#1,2659
compiler,2660
attaches,2661
Gong,2662
DustySky,2663
SPLM,2664
resilient,2665
comes,2666
step,2667
validate,2668
Samples,2669
subdomain,2670
flag,2671
waves,2672
spearphished,2673
analyst,2674
BlackTech,2675
right,2676
technologies,2677
deploys,2678
HBO,2679
CVE-2018-20250,2680
space,2681
[REDACTED].myftp.org,2682
Micro™,2683
conditional,2684
MSP,2685
project,2686
specializing,2687
Backdoor,2688
specialists,2689
Province,2690
unpacking,2691
Wingbird,2692
"mode,",2693
huge,2694
victimized,2695
Runtime,2696
accessed,2697
groups',2698
examine,2699
indicated,2700
Avast,2701
Virginia,2702
compile,2703
completely,2704
Crossbow,2705
produced,2706
Shrouded,2707
7Zip,2708
ceased,2709
9002,2710
destined,2711
scams,2712
little,2713
SSL,2714
follow-up,2715
TEMP.Periscope,2716
filenames,2717
failed,2718
selected,2719
radar,2720
socially,2721
Due,2722
" O
FinSpy S-MAL
",2723
Sweden,2724
encountered,2725
Process,2726
handling,2727
reach,2728
kill,2729
Among,2730
packaged,2731
MoonWind,2732
portion,2733
scan-and-exploit,2734
Zuckerberg,2735
seconds,2736
Smart,2737
diplomat,2738
notably,2739
e.g,2740
Committee,2741
apart,2742
Automated,2743
relationships,2744
layers,2745
opportunistically,2746
jobs,2747
concluded,2748
write,2749
goes,2750
TG-4127,2751
code-signing,2752
CozyDuke,2753
term,2754
obfuscations,2755
heists,2756
harvesting,2757
packer,2758
visitors,2759
Emmental,2760
Ploutus-D,2761
APT19,2762
makers,2763
analyzing,2764
Administration,2765
ASEAN,2766
Local,2767
African,2768
AWS,2769
Before,2770
Throughout,2771
8.26.21.120,2772
platforms,2773
umbrella,2774
women,2775
Vulnerability,2776
involvement,2777
bit,2778
Georgia,2779
CVE-2018-4878,2780
CVE-2015-2545,2781
returns,2782
parallel,2783
.dll,2784
reduce,2785
dumping,2786
13,2787
proof-of-concept,2788
authentication,2789
assume,2790
displays,2791
protocols,2792
implements,2793
silently,2794
encrypt,2795
entirely,2796
anonymous,2797
prevents,2798
statistics,2799
Firefox,2800
Norton,2801
Elderwood,2802
CMD,2803
192.119.15.35,2804
tasking,2805
Persian-language,2806
gives,2807
tank,2808
evolve,2809
Internet-facing,2810
MITRE,2811
graphical,2812
HomamDownloader,2813
overflow,2814
built-in,2815
belongs,2816
contrast,2817
FlawedAmmy,2818
NICKEL,2819
privacy,2820
Morphisec,2821
FlowerPippi,2822
pointed,2823
WMI,2824
ACADEMY,2825
Media,2826
whereas,2827
respective,2828
it's,2829
mind,2830
restart,2831
Similarly,2832
Older,2833
turned,2834
impacted,2835
decompressed,2836
linking,2837
subdomains,2838
occurs,2839
victimology,2840
coming,2841
mounting,2842
era,2843
discovering,2844
presidential,2845
Content,2846
gets,2847
Point,2848
Check,2849
doppelganger,2850
class,2851
Custom,2852
lock,2853
apparel,2854
directed,2855
decryptor,2856
Bangladesh,2857
GitHub,2858
undocumented,2859
field,2860
.PDF,2861
specified,2862
FinFisher,2863
’ve,2864
seek,2865
develop,2866
identities,2867
businessmen,2868
give,2869
85,2870
actor’s,2871
.exe,2872
clicked,2873
phones,2874
lines,2875
gateway,2876
globally,2877
WCry,2878
hugesoft.org,2879
Leader,2880
office,2881
Targets,2882
People's,2883
alternate,2884
incorporate,2885
medium,2886
descriptions,2887
thought,2888
legal,2889
colleagues,2890
wrote,2891
traces,2892
C,2893
Pupy,2894
benign,2895
APT3,2896
Henkel,2897
State,2898
group's,2899
motives,2900
dedicated,2901
observation,2902
IDA,2903
identifiers,2904
posting,2905
risk,2906
University,2907
MMAT_GLBOPT2,2908
worked,2909
words,2910
RASPITE,2911
unc,2912
:f,2913
rundll32.exe,2914
droppers,2915
layer,2916
remediation,2917
spring,2918
nation,2919
stopping,2920
dword_745BB58C,2921
achieved,2922
nation-state,2923
correct,2924
physical,2925
elements,2926
deobfuscate,2927
amongst,2928
Previous,2929
destination,2930
registrars,2931
pieces,2932
moving,2933
unflattening,2934
front,2935
students,2936
rich,2937
lucrative,2938
decoys,2939
dealer,2940
didn’t,2941
introduced,2942
broader,2943
Hex-Rays,2944
PowerShell-based,2945
offensive,2946
Jordan,2947
Afghanistan,2948
played,2949
Muslim,2950
insights,2951
enhance,2952
politics,2953
tied,2954
captured,2955
wider,2956
Anchor,2957
Austria,2958
journalist,2959
indiscriminately,2960
DOGCALL,2961
Activity,2962
timestamps,2963
"groups.10,11",2964
mobile,2965
engines,2966
measures,2967
invoked,2968
Traffic,2969
defenders,2970
covertly,2971
Deepen,2972
decision,2973
mouse,2974
NSA,2975
learn,2976
Still,2977
Angola,2978
mid-2016,2979
surfaced,2980
resembles,2981
caused,2982
abuse,2983
WinRar,2984
Shun,2985
Saffron,2986
Rose,2987
unpacked,2988
properly,2989
Aside,2990
Red,2991
Liberation,2992
describes,2993
wage,2994
they've,2995
reboot,2996
Secure,2997
NanoCore,2998
hiding,2999
